axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_lptim.c
/**
*\*\name    LPTIM_FLAG_Clear.
*\*\fun     Check the low power timer flag.
*\*\param   LPTIMx 
*\*\          -Low-Power Timer instance
*\*\param   LPTIM_flag_check 
*\*\         -LPTIM_INTSTS_FLAG_CMPM     compare match interrupt 
*\*\         -LPTIM_INTSTS_FLAG_ARRM     a autoreload match interrupt
*\*\         -LPTIM_INTSTS_FLAG_EXTRIG   a valid edge on the selected external trigger input
*\*\         -LPTIM_INTSTS_FLAG_CMPUPD   the APB bus write operation to the LPTIMx_CMP register has been successfully completed
*\*\         -LPTIM_INTSTS_FLAG_ARRUPD   the APB bus write operation to the LPTIMx_ARR register has been successfully completed
*\*\         -LPTIM_INTSTS_FLAG_UP       the counter direction has changed from down to up (when the LPTIM instance operates in encoder mode)
*\*\         -LPTIM_INTSTS_FLAG_DOWN     the counter direction has changed from up to down (when the LPTIM instance operates in encoder mode)
*\*\return  none
**/
FlagStatus LPTIM_Flag_Get(LPTIM_Module *LPTIMx, uint32_t LPTIM_flag)
{
  return (((LPTIMx->INTSTS & LPTIM_flag) == LPTIM_flag) ? SET : RESET);
}


/** LPTIM_EF_IT_Management Interrupt Management **/


/**
*\*\name    LPTIM_Interrupt_Enable.
*\*\fun     Enable the low-power Timer interrupt.
*\*\param   LPTIMx 
*\*\          -Low-Power Timer instance
*\*\param   LPTIM_interrupt_flag
*\*\         -LPTIM_INT_CMPMIE     compare match interrupt
*\*\         -LPTIM_INT_ARRMIE     autoreload match interrupt
*\*\         -LPTIM_INT_EXTRIGIE   external trigger valid edge interrupt
*\*\         -LPTIM_INT_CMPUPDIE   compare register write completed interrupt
*\*\         -LPTIM_INT_ARRUPDIE   autoreload register write completed interrupt
*\*\         -LPTIM_INT_UPIE       direction change to up interrupt
*\*\         -LPTIM_INT_DOWNIE     direction change to down interrupt
*\*\return  none
**/
void LPTIM_Interrupt_Enable(LPTIM_Module *LPTIMx, uint32_t LPTIM_interrupt_flag)
{
  LPTIMx->INTEN |= LPTIM_interrupt_flag;
}



/**
*\*\name    LPTIM_Interrupt_Disable.
*\*\fun     Disable the low-power Timer interrupt.
*\*\param   LPTIMx 
*\*\          -Low-Power Timer instance
*\*\param   LPTIM_interrupt_flag
*\*\         -LPTIM_INT_CMPMIE    compare match interrupt
*\*\         -LPTIM_INT_ARRMIE    autoreload match interrupt
*\*\         -LPTIM_INT_EXTRIGIE  external trigger valid edge interrupt
*\*\         -LPTIM_INT_CMPUPDIE  compare register write completed interrupt
*\*\         -LPTIM_INT_ARRUPDIE  autoreload register write completed interrupt
*\*\         -LPTIM_INT_UPIE      direction change to up interrupt
*\*\         -LPTIM_INT_DOWNIE    direction change to down interrupt
*\*\return  none
**/
void LPTIM_Interrupt_Disable(LPTIM_Module *LPTIMx, uint32_t LPTIM_interrupt_flag)
{
  LPTIMx->INTEN &= ~LPTIM_interrupt_flag;
}


/**
*\*\name    LPTIM_Interrupt_Check.
*\*\fun     Check the low-power Timer interrupt.
*\*\param   LPTIMx 
*\*\         -Low-Power Timer instance
*\*\param   LPTIM_interrupt
*\*\         -LPTIM_INT_CMPMIE    compare match interrupt
*\*\         -LPTIM_INT_ARRMIE    the autoreload match interrupt
*\*\         -LPTIM_INT_EXTRIGIE  external trigger valid edge interrupt
*\*\         -LPTIM_INT_CMPUPDIE  compare register write completed interrupt
*\*\         -LPTIM_INT_ARRUPDIE  autoreload register write completed interrupt
*\*\         -LPTIM_INT_UPIE      direction change to up interrupt
*\*\         -LPTIM_INT_DOWNIE    direction change to down interrupt
*\*\return  none
**/

INTStatus LPTIM_Interrupt_Check(LPTIM_Module *LPTIMx, uint32_t LPTIM_interrupt)
{
  return (((LPTIMx->INTEN & LPTIM_interrupt) == LPTIM_interrupt) ? SET : RESET);
}

